In [26]:
# Importing libraries
import pandas as pd
import numpy as np
import os

In [29]:
# Import the new customer data set as a dataframe.
customer = pd.read_csv(r'C:\Users\49157\Downloads\Instacart Basket Analysis\02 Data\Original Data\customers\customers.csv', index_col = False)

In [3]:
# Wrangle the data so that it follows consistent logic, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.
customer.shape

(206209, 10)

In [4]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
# Renaming columns
customer.rename(columns={
    'First Name': 'first_name',
    'Surnam': 'surname',
    'STATE': 'state',
    'Gender' : 'gender',
    'Age' : 'age',
    'n_dependants': 'number_of_dependants',
    'fam_status': 'family_status',
}, inplace=True)

In [7]:
customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# Removing columns that do not add anything to the analysis
customer = customer.drop(columns = ['gender'])

In [9]:
customer.head()

,user_id,first_name,surname,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Check for and address missing values and duplicates, and convert any mixed-type data.
# Checking for mixed-type data
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)

first_name

C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\49157\AppData\Local\Temp\ipykernel_14984\3962342792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)

In [6]:
# Finding missing values
customer.isnull().sum()

user_id                     0
first_name              11259
surname                     0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
family_status               0
income                      0
dtype: int64

In [7]:
customer.shape

(206209, 9)

In [7]:
customer_clean = customer[customer['first_name'].isnull() == False]

In [13]:
customer_clean

,user_id,first_name,surname,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,New York,55,4/1/2020,1,married,57095

In [8]:
customer_clean.shape

(194950, 9)

In [9]:
# Finding duplicates
customer_dups = customer_clean[customer_clean.duplicated()]

In [11]:
customer_dups

Empty DataFrame
Columns: [user_id, first_name, surname, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

In [ ]:
# Importing the prepared Instacart ords_prods_merged_derived_aggregated_variables.
ords_prods_merged = pd.read_pickle (r'C:\Users\49157\Downloads\Instacart Basket Analysis\02 Data\Prepared Data\ords_prods_merged_derived_aggregated_variables.pkl')

In [13]:
# Checking the output of both data frames
ords_prods_merged.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,spender_types,spender_flag,customer_frequency,frequency_flag
0,0,2539329,1,prior,1,2,8,NaN,196,1,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,Low spender,6.367797,Low spender,20.5,Non-frequent customer
1,1,2539329,1,prior,1,2,8,NaN,14084,2,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,High spender,6.367797,Low spender,20.5,Non-frequent customer
2,2,2539329,1,prior,1,2,8,NaN,12427,3,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,Low spender,6.367797,Low spender,20.5,Non-frequent customer
3,3,2539329,1,prior,1,2,8,NaN,26088,4,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,Low spender,6.367797,Low spender,20.5,Non-frequent customer
4,4,2539329,1,prior,1,2,8,NaN,26405,5,...,Low-range product,Regularly busy,Regularly busy,Average orders,10,Low spender,6.367797,Low spender,20.5,Non-frequent customer

In [14]:
customer.head()

,user_id,first_name,surname,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Maryland,26,1/1/2017,1,married,40374

In [12]:
ords_prods_merged.shape

(32404859, 27)

In [13]:
customer.shape

(206209, 9)

In [15]:
# Checking the data types
ords_prods_merged.dtypes

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
_merge                     object
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
price_range                object
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
spender_types             float64
spender_flag               object
customer_frequency        float64
frequency_flag             object
dtype: object

In [16]:
customer.dtypes

user_id                  int64
first_name              object
surname                 object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
family_status           object
income                   int64
dtype: object

In [17]:
# Identify float64 columns
float64_cols = ords_prods_merged.select_dtypes(include=['float64']).columns

In [18]:
# Convert float64 columns to float32
ords_prods_merged[float64_cols] = ords_prods_merged[float64_cols].astype('float32')

In [19]:
# Display the data types to verify the changes
print(ords_prods_merged.dtypes)

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float32
product_id                  int64
add_to_cart_order           int64
reordered                   int64
_merge                     object
product_name               object
aisle_id                    int64
department_id               int64
prices                    float32
price_range                object
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
spender_types             float32
spender_flag               object
customer_frequency        float32
frequency_flag             object
dtype: object

In [11]:
# Select necessary columns to avoid memory error
ords_prods_reduced = ords_prods_merged[['order_id', 'user_id', 'order_hour_of_day', 'prices', 'loyalty_flag']]

In [12]:
customer_reduced = customer[['user_id', 'age','number_of_dependants', 'family_status', 'income']]

In [14]:
# Ensuring key columns are the same data type
ords_prods_reduced['user_id'] = ords_prods_merged['user_id'].astype(str)
customer_reduced['user_id'] = customer['user_id'].astype(str)

C:\Users\49157\AppData\Local\Temp\ipykernel_19688\2158329431.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ords_prods_reduced['user_id'] = ords_prods_merged['user_id'].astype(str)
C:\Users\49157\AppData\Local\Temp\ipykernel_19688\2158329431.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customer_reduced['user_id'] = customer['user_id'].astype(str)

In [15]:
# Merge the DataFrames
df_merged_large = ords_prods_reduced.merge(customer_reduced, on='user_id', indicator=True)

In [16]:
# Print out the first 5 rows
print(df_merged_large.head(5))

   order_id user_id  order_hour_of_day  prices  loyalty_flag  age  \
0   2539329       1                  8     9.0   Low spender   31
1   2539329       1                  8    12.5  High spender   31
2   2539329       1                  8     4.4   Low spender   31
3   2539329       1                  8     4.7   Low spender   31
4   2539329       1                  8     1.0   Low spender   31

   number_of_dependants family_status  income _merge
0                     3       married   40423   both
1                     3       married   40423   both
2                     3       married   40423   both
3                     3       married   40423   both
4                     3       married   40423   both

In [17]:
# Creating path
path = r'C:\Users\49157\Downloads\Instacart Basket Analysis'
path

'C:\\Users\\49157\\Downloads\\Instacart Basket Analysis'

In [18]:
# Exporting the merged data frame
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_customer_reduced_merged'))